results/jetty.ring.r60k.t16.c400.d600s.out
Running 10m test @ http://localhost:9999/math/plus?x=1&y=2
  16 threads and 400 connections
  Thread calibration: mean lat.: 7.046ms, rate sampling interval: 29ms
  Thread calibration: mean lat.: 7.106ms, rate sampling interval: 29ms
  Thread calibration: mean lat.: 7.217ms, rate sampling interval: 30ms
  Thread calibration: mean lat.: 7.184ms, rate sampling interval: 29ms
  Thread calibration: mean lat.: 7.596ms, rate sampling interval: 31ms
  Thread calibration: mean lat.: 7.742ms, rate sampling interval: 32ms
  Thread calibration: mean lat.: 7.901ms, rate sampling interval: 32ms
  Thread calibration: mean lat.: 8.508ms, rate sampling interval: 36ms
  Thread calibration: mean lat.: 7.459ms, rate sampling interval: 31ms
  Thread calibration: mean lat.: 6.984ms, rate sampling interval: 29ms
  Thread calibration: mean lat.: 7.653ms, rate sampling interval: 31ms
  Thread calibration: mean lat.: 7.306ms, rate sampling interval: 31ms
  Thread calibration: mean lat.: 7.660ms, rate sampling interval: 31ms
  Thread calibration: mean lat.: 7.924ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 7.685ms, rate sampling interval: 32ms
  Thread calibration: mean lat.: 6.968ms, rate sampling interval: 29ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.18ms    7.21ms 314.37ms   88.73%
    Req/Sec     3.82k   607.77     9.07k    74.38%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.18ms
 75.000%    9.44ms
 90.000%   15.20ms
 99.000%   33.76ms
 99.900%   64.22ms
 99.990%  115.97ms
 99.999%  193.54ms
100.000%  314.62ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.055     0.000000            2         1.00
       1.292     0.100000      3539311         1.11
       2.083     0.200000      7081243         1.25
       2.991     0.300000     10618410         1.43
       4.011     0.400000     14161832         1.67
       5.175     0.500000     17697204         2.00
       5.835     0.550000     19471718         2.22
       6.555     0.600000     21238794         2.50
       7.387     0.650000     23012253         2.86
       8.335     0.700000     24786068         3.33
       9.439     0.750000     26550491         4.00
      10.087     0.775000     27431977         4.44
      10.791     0.800000     28316442         5.00
      11.623     0.825000     29203726         5.71
      12.583     0.850000     30089253         6.67
      13.727     0.875000     30969412         8.00
      14.415     0.887500     31412516         8.89
      15.199     0.900000     31855267        10.00
      16.087     0.912500     32297447        11.43
      17.151     0.925000     32742134        13.33
      18.431     0.937500     33183608        16.00
      19.183     0.943750     33402546        17.78
      20.031     0.950000     33623949        20.00
      21.055     0.956250     33847654        22.86
      22.223     0.962500     34066274        26.67
      23.663     0.968750     34288091        32.00
      24.511     0.971875     34398676        35.56
      25.455     0.975000     34508637        40.00
      26.559     0.978125     34618636        45.71
      27.903     0.981250     34730037        53.33
      29.519     0.984375     34839905        64.00
      30.495     0.985938     34895430        71.11
      31.599     0.987500     34950439        80.00
      32.895     0.989062     35006805        91.43
      34.399     0.990625     35061303       106.67
      36.255     0.992188     35116383       128.00
      37.375     0.992969     35143899       142.22
      38.687     0.993750     35171960       160.00
      40.191     0.994531     35199343       182.86
      42.015     0.995313     35227175       213.33
      44.223     0.996094     35254662       256.00
      45.567     0.996484     35268245       284.44
      47.103     0.996875     35282257       320.00
      48.863     0.997266     35295992       365.71
      50.975     0.997656     35309725       426.67
      53.631     0.998047     35323680       512.00
      55.199     0.998242     35330489       568.89
      56.959     0.998437     35337373       640.00
      59.103     0.998633     35344372       731.43
      61.567     0.998828     35351226       853.33
      64.671     0.999023     35358151      1024.00
      66.495     0.999121     35361626      1137.78
      68.607     0.999219     35365026      1280.00
      71.103     0.999316     35368545      1462.86
      74.111     0.999414     35371986      1706.67
      77.631     0.999512     35375416      2048.00
      79.871     0.999561     35377154      2275.56
      82.367     0.999609     35378853      2560.00
      85.375     0.999658     35380604      2925.71
      88.639     0.999707     35382330      3413.33
      92.799     0.999756     35384049      4096.00
      95.167     0.999780     35384897      4551.11
      98.047     0.999805     35385770      5120.00
     101.311     0.999829     35386635      5851.43
     105.279     0.999854     35387494      6826.67
     110.143     0.999878     35388353      8192.00
     113.215     0.999890     35388788      9102.22
     116.735     0.999902     35389217     10240.00
     120.511     0.999915     35389648     11702.86
     125.375     0.999927     35390083     13653.33
     131.583     0.999939     35390524     16384.00
     134.271     0.999945     35390730     18204.44
     138.367     0.999951     35390950     20480.00
     142.335     0.999957     35391163     23405.71
     147.199     0.999963     35391375     27306.67
     154.111     0.999969     35391596     32768.00
     157.951     0.999973     35391701     36408.89
     162.175     0.999976     35391807     40960.00
     166.911     0.999979     35391919     46811.43
     173.055     0.999982     35392028     54613.33
     179.327     0.999985     35392131     65536.00
     183.551     0.999986     35392188     72817.78
     187.391     0.999988     35392240     81920.00
     191.359     0.999989     35392293     93622.86
     196.351     0.999991     35392348    109226.67
     201.599     0.999992     35392401    131072.00
     204.159     0.999993     35392428    145635.56
     208.255     0.999994     35392455    163840.00
     217.727     0.999995     35392482    187245.71
     228.223     0.999995     35392509    218453.33
     236.927     0.999996     35392537    262144.00
     241.919     0.999997     35392551    291271.11
     249.471     0.999997     35392563    327680.00
     254.207     0.999997     35392577    374491.43
     262.655     0.999998     35392590    436906.67
     276.991     0.999998     35392604    524288.00
     279.039     0.999998     35392612    582542.22
     280.063     0.999998     35392617    655360.00
     284.927     0.999999     35392624    748982.86
     289.023     0.999999     35392631    873813.33
     294.143     0.999999     35392639   1048576.00
     295.679     0.999999     35392642   1165084.44
     296.191     0.999999     35392644   1310720.00
     299.263     0.999999     35392649   1497965.71
     299.519     0.999999     35392651   1747626.67
     301.567     1.000000     35392655   2097152.00
     301.823     1.000000     35392656   2330168.89
     302.591     1.000000     35392658   2621440.00
     303.103     1.000000     35392660   2995931.43
     304.127     1.000000     35392661   3495253.33
     307.711     1.000000     35392663   4194304.00
     307.967     1.000000     35392664   4660337.78
     308.735     1.000000     35392665   5242880.00
     308.991     1.000000     35392666   5991862.86
     308.991     1.000000     35392666   6990506.67
     309.759     1.000000     35392667   8388608.00
     311.295     1.000000     35392668   9320675.55
     311.295     1.000000     35392668  10485760.00
     311.551     1.000000     35392669  11983725.71
     311.551     1.000000     35392669  13981013.34
     311.551     1.000000     35392669  16777216.00
     312.319     1.000000     35392670  18641351.10
     312.319     1.000000     35392670  20971519.98
     312.319     1.000000     35392670  23967451.45
     312.319     1.000000     35392670  27962026.68
     312.319     1.000000     35392670  33554432.00
     314.623     1.000000     35392671  37282702.28
     314.623     1.000000     35392671          inf
#[Mean    =        7.181, StdDeviation   =        7.213]
#[Max     =      314.368, Total count    =     35392671]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  35992204 requests in 10.00m, 5.56GB read
Requests/sec:  59987.03
Transfer/sec:      9.50MB